{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.16.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "keras_layer_input"}}, {"class_name": "KerasLayer", "config": {"name": "keras_layer", "trainable": false, "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "handle": "https://www.kaggle.com/models/google/mobilenet-v3/frameworks/TensorFlow2/variations/large-075-224-classification/versions/1", "output_shape": [1280]}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 9.999999747378752e-05}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "dense/kernel", "shape": [1001, 512], "dtype": "float32"}, {"name": "dense/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [512, 5], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [5], "dtype": "float32"}, {"name": "MobilenetV3/Conv/BatchNorm/gamma", "shape": [16], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_2/depthwise/BatchNorm/beta", "shape": [72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/biases", "shape": [72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/expand/BatchNorm/gamma", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/project/BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_9/project/weights", "shape": [1, 1, 144, 64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/depthwise/BatchNorm/beta", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/expand/weights", "shape": [1, 1, 120, 720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/project/BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/squeeze_excite/Conv_1/biases", "shape": [384], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/squeeze_excite/Conv_1/biases", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_2/depthwise/BatchNorm/gamma", "shape": [72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_6/expand/BatchNorm/gamma", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_6/depthwise/BatchNorm/gamma", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_6/project/BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/project/BatchNorm/beta", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/depthwise/BatchNorm/beta", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/squeeze_excite/Conv/weights", "shape": [1, 1, 720, 184], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_2/expand/BatchNorm/gamma", "shape": [72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_8/project/BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/expand/BatchNorm/gamma", "shape": [384], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/expand/BatchNorm/gamma", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/squeeze_excite/Conv_1/weights", "shape": [1, 1, 184, 720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/squeeze_excite/Conv_1/biases", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_1/project/weights", "shape": [1, 1, 64, 24], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/depthwise/BatchNorm/gamma", "shape": [72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/depthwise/depthwise_weights", "shape": [5, 5, 96, 1], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_6/expand/weights", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_7/expand/BatchNorm/gamma", "shape": [160], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_8/depthwise/BatchNorm/beta", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/project/weights", "shape": [1, 1, 384, 88], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/squeeze_excite/Conv/biases", "shape": [136], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/weights", "shape": [1, 1, 96, 24], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_8/project/weights", "shape": [1, 1, 144, 64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_9/depthwise/BatchNorm/beta", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/depthwise/depthwise_weights", "shape": [3, 3, 528, 1], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/expand/BatchNorm/gamma", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/project/BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/project/weights", "shape": [1, 1, 96, 32], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_7/project/weights", "shape": [1, 1, 160, 64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/expand/BatchNorm/beta", "shape": [384], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/project/BatchNorm/beta", "shape": [120], "dtype": "float32"}, {"name": "MobilenetV3/Conv_2/weights", "shape": [1, 1, 720, 1280], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_2/depthwise/depthwise_weights", "shape": [3, 3, 72, 1], "dtype": "float32"}, {"name": "MobilenetV3/Conv/weights", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/biases", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_7/depthwise/BatchNorm/beta", "shape": [160], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/depthwise/BatchNorm/gamma", "shape": [384], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/expand/weights", "shape": [1, 1, 88, 528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/squeeze_excite/Conv/biases", "shape": [184], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_1/depthwise/depthwise_weights", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/depthwise/BatchNorm/beta", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_7/project/BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/squeeze_excite/Conv_1/biases", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/expand/BatchNorm/beta", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/squeeze_excite/Conv_1/weights", "shape": [1, 1, 24, 72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/depthwise/depthwise_weights", "shape": [5, 5, 96, 1], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_7/project/BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_9/project/BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/expand/weights", "shape": [1, 1, 88, 528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/depthwise/BatchNorm/gamma", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv/project/weights", "shape": [1, 1, 16, 16], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_1/expand/BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_8/depthwise/BatchNorm/gamma", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/squeeze_excite/Conv/weights", "shape": [1, 1, 528, 136], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/squeeze_excite/Conv_1/biases", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_1/expand/BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/project/BatchNorm/beta", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_1/expand/weights", "shape": [1, 1, 16, 64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/project/BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/project/BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_8/expand/BatchNorm/gamma", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_9/expand/BatchNorm/gamma", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/depthwise/depthwise_weights", "shape": [3, 3, 384, 1], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/project/BatchNorm/gamma", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/expand/BatchNorm/gamma", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/squeeze_excite/Conv_1/weights", "shape": [1, 1, 184, 720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_8/expand/weights", "shape": [1, 1, 64, 144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/depthwise/BatchNorm/beta", "shape": [384], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/squeeze_excite/Conv_1/weights", "shape": [1, 1, 136, 528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/expand/BatchNorm/beta", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/expand/BatchNorm/beta", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_7/depthwise/BatchNorm/gamma", "shape": [160], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_8/project/BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_9/expand/weights", "shape": [1, 1, 64, 144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_9/project/BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/depthwise/BatchNorm/beta", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/expand/BatchNorm/beta", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/depthwise/BatchNorm/gamma", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/depthwise/depthwise_weights", "shape": [5, 5, 72, 1], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/expand/weights", "shape": [1, 1, 32, 96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/weights", "shape": [1, 1, 24, 96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_7/depthwise/depthwise_weights", "shape": [3, 3, 160, 1], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/project/BatchNorm/gamma", "shape": [120], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/project/BatchNorm/beta", "shape": [120], "dtype": "float32"}, {"name": "MobilenetV3/Conv_2/biases", "shape": [1280], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_1/project/BatchNorm/beta", "shape": [24], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/depthwise/BatchNorm/beta", "shape": [72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/expand/BatchNorm/beta", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/squeeze_excite/Conv/weights", "shape": [1, 1, 384, 96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/depthwise/BatchNorm/beta", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/Conv_1/weights", "shape": [1, 1, 120, 720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/project/BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV3/Conv/BatchNorm/beta", "shape": [16], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_7/expand/weights", "shape": [1, 1, 64, 160], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_9/depthwise/BatchNorm/gamma", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/expand/BatchNorm/gamma", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/project/BatchNorm/beta", "shape": [120], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/project/BatchNorm/gamma", "shape": [120], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/expand/weights", "shape": [1, 1, 24, 72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/weights", "shape": [1, 1, 96, 24], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/depthwise/BatchNorm/beta", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_6/expand/BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/squeeze_excite/Conv/biases", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/project/weights", "shape": [1, 1, 528, 88], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/depthwise/depthwise_weights", "shape": [5, 5, 528, 1], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/expand/weights", "shape": [1, 1, 120, 720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/depthwise/depthwise_weights", "shape": [5, 5, 720, 1], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv/project/BatchNorm/beta", "shape": [16], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/depthwise/BatchNorm/gamma", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/squeeze_excite/Conv_1/weights", "shape": [1, 1, 136, 528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_2/expand/BatchNorm/beta", "shape": [72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/biases", "shape": [24], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/expand/BatchNorm/gamma", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_6/depthwise/BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_9/depthwise/depthwise_weights", "shape": [3, 3, 144, 1], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/depthwise/BatchNorm/gamma", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_2/project/BatchNorm/gamma", "shape": [24], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/project/BatchNorm/gamma", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv/depthwise/depthwise_weights", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv/depthwise/BatchNorm/gamma", "shape": [16], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_2/expand/weights", "shape": [1, 1, 24, 72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/weights", "shape": [1, 1, 72, 24], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/squeeze_excite/Conv/weights", "shape": [1, 1, 720, 184], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/project/weights", "shape": [1, 1, 720, 120], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/project/weights", "shape": [1, 1, 72, 32], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/squeeze_excite/Conv_1/weights", "shape": [1, 1, 96, 384], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/project/BatchNorm/gamma", "shape": [120], "dtype": "float32"}, {"name": "MobilenetV3/Logits/Conv2d_1c_1x1/weights", "shape": [1, 1, 1280, 1001], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/depthwise/BatchNorm/gamma", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/expand/BatchNorm/beta", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_1/depthwise/BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/expand/BatchNorm/beta", "shape": [72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_2/project/weights", "shape": [1, 1, 72, 24], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/expand/BatchNorm/gamma", "shape": [72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/project/weights", "shape": [1, 1, 96, 32], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_6/project/BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_7/expand/BatchNorm/beta", "shape": [160], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/squeeze_excite/Conv/biases", "shape": [184], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_6/project/weights", "shape": [1, 1, 192, 64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/expand/weights", "shape": [1, 1, 64, 384], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/squeeze_excite/Conv/weights", "shape": [1, 1, 528, 136], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/project/weights", "shape": [1, 1, 528, 120], "dtype": "float32"}, {"name": "MobilenetV3/Conv_1/BatchNorm/beta", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv/project/BatchNorm/gamma", "shape": [16], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/biases", "shape": [24], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/biases", "shape": [24], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_6/depthwise/depthwise_weights", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_8/expand/BatchNorm/beta", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/depthwise/BatchNorm/gamma", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/squeeze_excite/Conv/biases", "shape": [136], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/weights", "shape": [1, 1, 24, 96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_9/expand/BatchNorm/beta", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/project/weights", "shape": [1, 1, 720, 120], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/squeeze_excite/Conv_1/biases", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv/depthwise/BatchNorm/beta", "shape": [16], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_1/depthwise/BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_1/project/BatchNorm/gamma", "shape": [24], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_8/depthwise/depthwise_weights", "shape": [3, 3, 144, 1], "dtype": "float32"}, {"name": "MobilenetV3/Logits/Conv2d_1c_1x1/biases", "shape": [1001], "dtype": "float32"}, {"name": "MobilenetV3/Conv_1/BatchNorm/gamma", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/expand/weights", "shape": [1, 1, 32, 96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_2/project/BatchNorm/beta", "shape": [24], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/depthwise/depthwise_weights", "shape": [5, 5, 720, 1], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv/project/BatchNorm/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/expand/BatchNorm/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_9/depthwise/BatchNorm/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_2/project/BatchNorm/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_7/project/BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/project/BatchNorm/moving_variance", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/expand/BatchNorm/moving_mean", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/depthwise/BatchNorm/moving_mean", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_1/expand/BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_9/expand/BatchNorm/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_9/expand/BatchNorm/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/project/BatchNorm/moving_variance", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/depthwise/BatchNorm/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/expand/BatchNorm/moving_mean", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/depthwise/BatchNorm/moving_mean", "shape": [72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/project/BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV3/Conv_1/BatchNorm/moving_mean", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/Conv_1/BatchNorm/moving_variance", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/Conv/BatchNorm/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_1/depthwise/BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_2/expand/BatchNorm/moving_mean", "shape": [72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_2/depthwise/BatchNorm/moving_mean", "shape": [72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_8/expand/BatchNorm/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/expand/BatchNorm/moving_mean", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/depthwise/BatchNorm/moving_variance", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/depthwise/BatchNorm/moving_variance", "shape": [72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/expand/BatchNorm/moving_variance", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/project/BatchNorm/moving_variance", "shape": [120], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/project/BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/depthwise/BatchNorm/moving_variance", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_2/expand/BatchNorm/moving_variance", "shape": [72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/expand/BatchNorm/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/expand/BatchNorm/moving_variance", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_2/depthwise/BatchNorm/moving_variance", "shape": [72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_7/depthwise/BatchNorm/moving_mean", "shape": [160], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_8/expand/BatchNorm/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/expand/BatchNorm/moving_variance", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_2/project/BatchNorm/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/depthwise/BatchNorm/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/depthwise/BatchNorm/moving_mean", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/depthwise/BatchNorm/moving_variance", "shape": [720], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv/project/BatchNorm/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/expand/BatchNorm/moving_variance", "shape": [72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/expand/BatchNorm/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/project/BatchNorm/moving_mean", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/project/BatchNorm/moving_variance", "shape": [120], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/expand/BatchNorm/moving_mean", "shape": [72], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_6/expand/BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_7/depthwise/BatchNorm/moving_variance", "shape": [160], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_8/project/BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/project/BatchNorm/moving_variance", "shape": [120], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/depthwise/BatchNorm/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/project/BatchNorm/moving_mean", "shape": [120], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv/depthwise/BatchNorm/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/project/BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/expand/BatchNorm/moving_mean", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_13/project/BatchNorm/moving_mean", "shape": [120], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_6/depthwise/BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_6/project/BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_9/project/BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/project/BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_1/project/BatchNorm/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_7/project/BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_9/depthwise/BatchNorm/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/depthwise/BatchNorm/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_1/expand/BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_8/depthwise/BatchNorm/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/expand/BatchNorm/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_5/project/BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/expand/BatchNorm/moving_variance", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_12/depthwise/BatchNorm/moving_mean", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_6/expand/BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_8/project/BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_9/project/BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_14/project/BatchNorm/moving_mean", "shape": [120], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/depthwise/BatchNorm/moving_mean", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv/depthwise/BatchNorm/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "MobilenetV3/Conv/BatchNorm/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_4/depthwise/BatchNorm/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/depthwise/BatchNorm/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_3/project/BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_1/project/BatchNorm/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_7/expand/BatchNorm/moving_mean", "shape": [160], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/expand/BatchNorm/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_6/depthwise/BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_6/project/BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_8/depthwise/BatchNorm/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/expand/BatchNorm/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_10/project/BatchNorm/moving_mean", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_11/depthwise/BatchNorm/moving_variance", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_7/expand/BatchNorm/moving_variance", "shape": [160], "dtype": "float32"}, {"name": "MobilenetV3/expanded_conv_1/depthwise/BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}]}]}